app/controllers/navigator_controller.rb

  def view_weeks
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"