app/controllers/tasks_controller.rb

SELECT "months".* FROM "months"
SELECT "years".* FROM "years"
SELECT "days".* FROM "days"
---
  def new
    @months = Month.all
    @years = Year.all
    @days = Day.all

SELECT "months".* FROM "months"
SELECT "years".* FROM "years"
SELECT "days".* FROM "days"
---
  def edit
    @months = Month.all
    @years = Year.all
    @days = Day.all

INSERT INTO "tasks" ("name", "description", "day_id", "month_id", "year_id", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "this is me testing the lenght the thing is going to handle and what it is going to do with it."], ["updated_at", "2016-08-18 15:00:45.153326"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy
    @task.destroy